In [1]:
import pandas as pd
import numpy as np

In [2]:
data1 = {'Department': ['IT','IT','HR','HR','Trade','?','Trade','HR','IT'],
         'Education': ['Bachelor','Master','Master','Bachelor','PHD','PHD','Master','Master',''],
         'Sex': ['M','M','M','F','M','F','F','M','F'],
         'Title': ['analyst','analyst','analyst','analyst','associate','associate','associate','VP','VP'],
         'Year': [1.0,2.0,2.0,2.0,3.0,5.0,np.nan,8.0,9.0],
         'Name': ['Bob','Jake','John','Judy','Sam','Amy','Jennifer','Peter','Mary'],
         'Salary': [90,90,90,90,120,120,120,250,250]}
Employee = pd.DataFrame(data1)
Employee

  Department Education      Name  Salary Sex      Title  Year
0         IT  Bachelor       Bob      90   M    analyst   1.0
1         IT    Master      Jake      90   M    analyst   2.0
2         HR    Master      John      90   M    analyst   2.0
3         HR  Bachelor      Judy      90   F    analyst   2.0
4      Trade       PHD       Sam     120   M  associate   3.0
5          ?       PHD       Amy     120   F  associate   5.0
6      Trade    Master  Jennifer     120   F  associate   NaN
7         HR    Master     Peter     250   M         VP   8.0
8         IT                Mary     250   F         VP   9.0

In [4]:
np.sum(Employee.isnull())

Department    0
Education     0
Name          0
Salary        0
Sex           0
Title         0
Year          1
dtype: int64

In [6]:
Employee[Employee.isnull().any(axis=1)]

  Department Education      Name  Salary Sex      Title  Year
6      Trade    Master  Jennifer     120   F  associate   NaN

In [8]:
Employee[Employee.notnull().all(axis=1)]

  Department Education   Name  Salary Sex      Title  Year
0         IT  Bachelor    Bob      90   M    analyst   1.0
1         IT    Master   Jake      90   M    analyst   2.0
2         HR    Master   John      90   M    analyst   2.0
3         HR  Bachelor   Judy      90   F    analyst   2.0
4      Trade       PHD    Sam     120   M  associate   3.0
5          ?       PHD    Amy     120   F  associate   5.0
7         HR    Master  Peter     250   M         VP   8.0
8         IT             Mary     250   F         VP   9.0

In [9]:
Employee['Education']

0    Bachelor
1      Master
2      Master
3    Bachelor
4         PHD
5         PHD
6      Master
7      Master
8
Name: Education, dtype: object

In [11]:
pd.Series([1,np.nan,np.nan,4]).interpolate(method = "linear")

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [12]:
Employee.interpolate()

  Department Education      Name  Salary Sex      Title  Year
0         IT  Bachelor       Bob      90   M    analyst   1.0
1         IT    Master      Jake      90   M    analyst   2.0
2         HR    Master      John      90   M    analyst   2.0
3         HR  Bachelor      Judy      90   F    analyst   2.0
4      Trade       PHD       Sam     120   M  associate   3.0
5          ?       PHD       Amy     120   F  associate   5.0
6      Trade    Master  Jennifer     120   F  associate   6.5
7         HR    Master     Peter     250   M         VP   8.0
8         IT                Mary     250   F         VP   9.0

In [15]:
help(Employee.interpolate)

Help on method interpolate in module pandas.core.generic:

interpolate(method='linear', axis=0, limit=None, inplace=False, limit_direction='forward', downcast=None, **kwargs) method of pandas.core.frame.DataFrame instance
    Interpolate values according to different methods.

    Please note that only ``method='linear'`` is supported for
    DataFrames/Series with a MultiIndex.

    Parameters
    ----------
    method : {'linear', 'time', 'index', 'values', 'nearest', 'zero',
              'slinear', 'quadratic', 'cubic', 'barycentric', 'krogh',
              'polynomial', 'spline', 'piecewise_polynomial',
              'from_derivatives', 'pchip', 'akima'}

        * 'linear': ignore the index and treat the values as equally
          spaced. This is the only method supported on MultiIndexes.
          default
        * 'time': interpolation works on daily and higher resolution
          data to interpolate given length of interval
        * 'index', 'values': use the actual numerical values of the index
        * 'nearest', 'zero', 'slinear', 'quadratic', 'cubic',
          'barycentric', 'polynomial' is passed to
          ``scipy.interpolate.interp1d``. Both 'polynomial' and 'spline'
          require that you also specify an `order` (int),
          e.g. df.interpolate(method='polynomial', order=4).
          These use the actual numerical values of the index.
        * 'krogh', 'piecewise_polynomial', 'spline', 'pchip' and 'akima' are all
          wrappers around the scipy interpolation methods of similar
          names. These use the actual numerical values of the index. See
          the scipy documentation for more on their behavior
          `here <http://docs.scipy.org/doc/scipy/reference/interpolate.html#univariate-interpolation>`__  # noqa
          `and here <http://docs.scipy.org/doc/scipy/reference/tutorial/interpolate.html>`__  # noqa
        * 'from_derivatives' refers to BPoly.from_derivatives which
          replaces 'piecewise_polynomial' interpolation method in scipy 0.18

        .. versionadded:: 0.18.1

           Added support for the 'akima' method
           Added interpolate method 'from_derivatives' which replaces
           'piecewise_polynomial' in scipy 0.18; backwards-compatible with
           scipy < 0.18

    axis : {0, 1}, default 0
        * 0: fill column-by-column
        * 1: fill row-by-row
    limit : int, default None.
        Maximum number of consecutive NaNs to fill.
    limit_direction : {'forward', 'backward', 'both'}, defaults to 'forward'
        If limit is specified, consecutive NaNs will be filled in this
        direction.

        .. versionadded:: 0.17.0

    inplace : bool, default False
        Update the NDFrame in place if possible.
    downcast : optional, 'infer' or None, defaults to None
        Downcast dtypes if possible.
    kwargs : keyword arguments to pass on to the interpolating function.

    Returns
    -------
    Series or DataFrame of same shape interpolated at the NaNs

    See Also
    --------
    reindex, replace, fillna

    Examples
    --------

    Filling in NaNs

    >>> s = pd.Series([0, 1, np.nan, 3])
    >>> s.interpolate()
    0    0
    1    1
    2    2
    3    3
    dtype: float64

In [18]:
temp = Employee.groupby('Title')

In [23]:
temp['Salary'].agg('mean')

Title
VP           250
analyst       90
associate    120
Name: Salary, dtype: int64

In [20]:
temp['Salary']

In [24]:
type(temp['Salary'].agg('mean'))

pandas.core.series.Series

In [25]:
temp['Salary'].agg('mean').to_frame

<bound method Series.to_frame of Title
VP           250
analyst       90
associate    120
Name: Salary, dtype: int64>

In [27]:
Employee.loc[:,['Salary','Title']]

   Salary      Title
0      90    analyst
1      90    analyst
2      90    analyst
3      90    analyst
4     120  associate
5     120  associate
6     120  associate
7     250         VP
8     250         VP